function ChurchHistory() {
    return (<div className="container mx-auto">
        <h1 className="text-5xl text-center font-bold text-primary-500">教會歷史</h1>
        <div className="grid grid-cols-2 gap-6 my-15">
            <div className="p-4">
                <h2 className="text-4xl font-bold mb-6 text-primary-500">創立者——神僕倪頌德</h2>
                <span className="text-2xl text-primary-500">倪小姐是江蘇省吳縣人，她是主後一八九三年七月六日出生在清末的封建時 代裡；她年輕時就蒙主恩賜異象，她即決志献身傳道宣揚耶穌基督。因她十分仰 慕神耶穌基督真理，就不顧家庭反對，投入上海金陵女子神學院，決定献身為主 所用。神學院畢業後，她就衛理公會所屬會堂從事傳道工作，由於她事主忠勤， 神就賜給她智慧和能力，使她在事奉工作上，都能勝任愉快如願以償；神光照她、 引導她，漸漸進入屬靈的更高境界。<br /><br />由於倪小姐事奉工作的成就，中華神學院就邀聘她為該院的教授，任內殷勤 不懈，教導學生真是諄諄教誨，孜孜不倦；然後由教授調任為該院副院長，歷十 七年之久。後因患有十餘年風溼病痛及甲狀腺腫大，遂於民國三十六年夏在她家 鄉蘇州博習醫院割除甲狀腺出院後，尋求神的旨意，聖靈當時啓示了：出埃及記 廿三章20節的應許給她作前面的引導。同年九月接到江灣同學李幫助姊妹來信， 邀約來台，如是她心中十分明白，這是神為她所預備的地方――台灣。她就決心 放棄養病，由厦門買了機票，於九月十三日平安飛抵台南旋轉至高雄，她就這樣 的蒙神揀選差派來台，開始致力其第一階段傳福音、建教會的艱鉅工作。</span>
            </div>
            <div>
                <img src="images/founder.jpg" alt="" className="w-3/4" />
            </div>
        </div>
        <div className="grid grid-cols-6 gap-0 my-15">
            <div className="col-span-2 border-2 border-white border-b-primary-500 text-right py-2">
                <span className="text-primary-500 text-3xl font-bold">萌芽時期：（民國37年~40年）</span>
            </div>
            <div className="col-span-4"></div>
            <div className="col-span-4 col-start-3 bg-primary-100 rounded-2xl p-7 shadow-lg shadow-primary-200/50 mb-8">
                <h5 className="text-lg">民國三十七年春，約來台三、四個月左右，就發覺大陸來台人士不諳台語， 至感不便，遂興起了國語傳講福音工作；這時神就引導她在他們中間講道，初開 始時在一家聖徒的家中聚會，主日下午借用純正小學擧行主日禮拜，逐漸地由七 、八人增至五十人左右，就這樣開闢了高雄市福音的基礎。<br /><br />卅八年春，有一日她在禱告中，得到神的啓示，不但要傳福音給人，並且還 要她靠神建立一個有生命的教會來。按當時聚會情形，主日是在前金長老教會， 週間都是臨時分在各機關宿舍內擧行，並無固定地點供聚會使用，對聖工的活動 與聖徒交通，不免發生困難，只有求神賜給集中聚會的地方；於是她和眾聖徒就 憑著信心，放膽禱告，向主直求。感謝神！衪就開始動了善工，感動當時在高雄 郵局工作的弟兄，願將大港埔郵局內新建的郵務工會，無條件借供使用，於卅八 年五月八日開堂禮拜，並擧行佈道會七天，多人在神前認罪悔改，歸入基督。每 主日上午聚會人數約有四、五十人，下午查經，禮拜三禱告會，有時也擧行特別 聚會，這時信徒殷勤聚會，也充了聖靈的榮光，因此弟兄姊妹，滿有聖靈的能力 ，大家同心協力，興旺福音，人數逐漸漸增加。</h5>
            </div>
            <div className="col-span-2 border-2 border-white border-b-primary-500 text-right py-2">
                <span className="text-primary-500 text-3xl font-bold">創建時期：（民國41年~84年）</span>
            </div>
            <div className="col-span-4"></div>
            <div className="col-span-4 col-start-3 bg-primary-100 rounded-2xl p-7 shadow-lg shadow-primary-200/50 mb-8">
                <h5 className="text-lg">前面的一段路程，真是南風吹來，滿有聖靈的澆灌；可是和煦的南風，能使 人暢快欲睡，就如彼得在山上對主說：「我們在此真好」，以為在客居之地似可 不必建造會堂，即以郵務工會會址作為長久的打算，不付代價、受造就.傳福音， 幾乎把神託付靠主建立教會的責任忘掉了；神就興起了北風來操練眾人，四十年 十月下旬，郵局忽然通知，該局將改建郵政大厦，郵務工會要收回自用，十二月 間便要動工拆建；這北風吹醒了會眾，必須在短短期間內另覓聚會處所，此時租 屋難，買屋更難，只好交在全能的主手中，大家懇切禱告主，求主憐憫施恩，另 外預備聚會場所，經過兩個禮拜後，靠聖靈引導找到七賢一路八十八號現址，土 地有四百一十七坪（屬台糖公司地產），合乎將來建會堂及擴充之用，所以大家 都認為最合適，就決定承購；於是開始了三天的特別禱告會，懇切求神賜給款項 ，大家立志，不借款、不募捐，單單仰望神 ；一面與房東議價，房價由新台幣伍 萬元減至四萬六仟元（連土地轉讓權在內），分三期付款。在如期付出第一、二 期價款後，就在十二月底遷入，翌日為中華民國四十一年元旦，適逢主日禮拜， 就在新址，獻上感恩祭。四十二年春貝絲颳風吹跨了用來聚會的風雨棚後，激動 了全體弟兄姊妹再也不能不關心建築新會堂的事了。四十三年春吳勇弟兄來領培 靈會，在最後一晚擘餅聚會中，為建堂事多方見證勉勵，堅固了眾人的信心，於 是大家站在不募捐、不借錢、不收不信之人錢物的立場上，迫切求告神，同心協 力，不但献上自己 ，也把金銀飾物，甘心投入奉獻箱，建堂獻金數日不斷遞增， 達到六萬元的時候，開始設計可容二百人會堂圖樣，於四十三年十一月五日破土 動工，並在基石上，謹刻神的話語：「基督耶穌降世為要拯救罪人」；會堂建地 五十坪，廿公尺長，十公尺寬，為一座鋼筋水泥磚牆瓦頂長方形禮拜堂。經過四 個半月，神使一切亨通，於四十四年三月中旬全部落成，工程費九萬八仟元。四 月十日復活節，擧行獻堂禮拜後，由吳勇弟兄主領培靈會五天，神的榮光充滿了 會堂。<br /><br />新會堂落成後，至四十四年冬台糖公司通知租地出售，教會承租之基地共 四百十七坪，每坪定價一百十八元，合計七萬伍仟零陸拾元正，教會有優先承購 權，並限期二個禮拜答復，惟在献堂末久，喘氣甫定財力支絀之際，又要支付大 筆購地費用，不無難處；但想到這是神賜給我們為地的產業，故仍本不募捐、不 借錢的初衷，再到主面前向衪祈求。神又一次聽了眾人急難中的求告，在短短二 個禮拜內得到叁萬元献金，付了定金，其餘分期付款至民國四十五年十月全部付 清，七賢一路八十八號土地四百十七坪，終於歸高雄國語禮拜堂名下，感謝讚美主！</h5>
            </div>
            <div className="col-span-2 border-2 border-white border-b-primary-500 text-right py-2">
                <span className="text-primary-500 text-3xl font-bold">重建時期：（民國85年~迄今）</span>
            </div>
            <div className="col-span-4"></div>
            <div className="col-span-4 col-start-3 bg-primary-100 rounded-2xl p-7 shadow-lg shadow-primary-200/50 mb-8">
                <h5 className="text-lg">本教會會堂重建，起因有二：第一、舊堂建造已四十餘年，不僅樑木漸朽， 鋼筋亦外露銹蝕；第二、舊會堂只能容納二百人，已不敷使用，民國七十五年二 月，教會經商討決定重建，延至七十八年四月始成立「建堂委員會」經過禱告、 研討，直到八十一年七月通過地下一層、地上七層建堂草案，正式向教會弟兄姊 妹報告，旋即聘請建築師負責新會堂之設計。後因同工信心不足，意見分歧無法 同心，建堂計劃一再修改，以致又延宕了三年，正應驗了經上的話說：「若不是 耶和華建造房屋，建造的人就枉然勞力…。」（詩一二七1）<br /><br />於是同工們迫切認罪、禱告，照著神起初給我們的異像，地下一層、地上七 層，並且秉承前輩們的信心榜樣，不募捐、不借錢、不收不信之人的金錢、不合 建、不賣地的原則，重新開始，神也一步一步帶領，八十四年十月另聘建築師， 從工程圖設計到建照核發，土木、水電工程招標，都十分順利；教會於民國八十 五年九月十五日擧行開工禮拜，等候多年的會堂重建工程終於正式開工了。<br /><br />「我們若照衪的旨意求什麼，衪就聽我們，這是我們向衪所存坦然無懼的心 。」（約壹五14），會堂開工之後，教會弟兄姊妹經歷了同心合意禱告的果效， 神不但垂聽，且從不誤事的成就，柒仟捌佰餘萬元的費用，不但按時充足的供應 ，且工程也照進度提前完工，因此教會於八十七年四月十一日擧行献堂感恩禮拜 ，願榮耀、頌讚歸給耶和華以勒的神。</h5>
            </div>
        </div>
    </div>)
}

export default ChurchHistory